# ДЗ 4. Создание блога.
"""
+. Создать базу данных database.sqlite в которой создать таблицу posts.
   Таблица должна содержать такие поля: id, name, description, date'.

2. Создать блог используя 4 страницы:
    .+ Страница для отображения всех записей в блоге,
       обычная выборка и отображение в темплейте.
    .+ Страница для добавления новой записи в блог, страница.
       должна принимать два параметра title и description.
    .+ Страница для редактирования записи в блоге, страница
       должна принимать один главный параметр это id и 
              title\description 
       для обновления информации по посту.
    .4 Страница для удаления поста, страница должна принимать 
       id поста которого хотим удалить.

3. После успешного выполнения 2, 3, 4 страницы редиректим
   (перенаправляем) на страницу со всеми постами.
   
4. Обязательно писать doc-string в каждой функции.

5. Добавить .gitignore в проект.

6. Добавить базу данных в проект.

7. В начале файла программы вставить комментарий
   \doc-string
   с командой которой вы создали таблицу.
  
8. Стилизация темплейта приветствуется, но не обязательно.

"""
